# это слова которые можно использовать для каждой команды, можете добавить свои или убрать лишние
ping = ('пинг', 'ping', 'gbyu', 'тпс')
players = ('игроки', 'buhjrb', 'online', 'players', 'онлайн')
ban = ('бан', 'забанить', 'ban', 'tempban', ',fy', 'pf,fybnm', 'ифт', 'пермач', 'пермбан', 'permban', 'gthvfx',
       'зукьифт')
unban = ('разбан', 'разбанить', 'hfp,fy', 'hfp,fybnm', 'unban', 'pardon', 'гтифт')
whitelist = ('вайтлист', 'вл', 'wl', 'whitelist', 'dfqnkbcn', 'dk')
kick = ('кик', 'кикнуть', 'kick', 'rbr', 'rbryenm', 'лшсл')
tp = ('tp', 'тп', 'телепортировать' ,'teleport')
donate = ('донат')

myvkid = 228  # ваш айди в вкк, без кавычек
adminsid = (1337,228822)  #айди админов, если нужно чтобы серверные команды использовали несколько человек. БЕЗ КАВЫЧЕК, ЧЕРЕЗ ЗАПЯТУЮ
grouptoken="" #между кавычек въебите свой токен ГРУППЫ, в токене должно быть разрешение на отправку сообщений(а лучше вообще все разрешения)
mytoken=""#здесь уже ваш личный токен, владельца группы в которой будет этот бот
serverip = ""#айпи сервера БЕЗ ПОРТА И ДВОЕТОЧИЯ
serverport = ''#ПОРТ
rconport = 1337 #ркон порт БЕЗ КАВЫЧЕК
rconPass = "" #ркон пароль